using System;
using System.IO;
using System.IO.Compression;
using System.Windows.Forms;
using System.Diagnostics;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.Win32;
using System.Security.Cryptography;
using System.Security.Permissions;
using System.Security.Principal;
using System.Management;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

internal static class Class22_startup
{
    public static string string_8;
    public static string string_15135;

    [STAThread]
    private static void Main()
    {
        bool l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭp̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = false;
        bool l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = false;
        bool l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = false;
        bool l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = false;
        bool l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = false;

        DirectoryInfo info = new DirectoryInfo(Environment.GetEnvironmentVariable("systemroot") + @"\Microsoft.NET\Framework");
        if (info.Exists)
        {
            DirectoryInfo[] directories = info.GetDirectories();
            for (int i = 0; i < directories.Length; i++)
            {
                if (directories[i].Name.Contains("v2.0.5"))
                {
                    l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭp̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = true;
                    string_8 = string_8 + ".NET Framework Version: 2.0" + Environment.NewLine;
                }
                if (directories[i].Name.Contains("v3.5"))
                {
                    string_8 = string_8 + ".NET Framework Version: 3.5" + Environment.NewLine;
                    l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = true;
                }
                if (directories[i].Name.Contains("v4"))
                {
                    string_8 = string_8 + ".NET Framework Version: 4.0" + Environment.NewLine;
                    l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ = true;
                }
            }
        }

        using (RegistryKey key = RegistryKey.OpenBaseKey((RegistryHive)RegistryHive.LocalMachine, (RegistryView)RegistryView.Registry32).OpenSubKey(@"SOFTWARE\Microsoft\NET Framework Setup\NDP\v4\Full\"))
        {
            if ((key != null) && (key.GetValue("Release") != null))
            {
                string_15135 = smethod_7((int)key.GetValue("Release"));
                string_8 = string_8 + ".NET Framework Version: " + string_15135;

                l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = true;
            }
        }

        if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ)
        {

            if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭp̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ || !l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ || !l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚ || !l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ)
            {
                if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭp̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚) MessageBox.Show(".Net framework not found" + Environment.NewLine + "Please install .Net framework 2.0 and 3.5", "BMTune", MessageBoxButtons.OK, MessageBoxIcon.Hand);
                else if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚) MessageBox.Show(".Net framework not found" + Environment.NewLine + "Please install .Net framework 3.5", "BMTune", MessageBoxButtons.OK, MessageBoxIcon.Hand);
                else if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚) MessageBox.Show(".Net framework not found" + Environment.NewLine + "Please install .Net framework 4.0", "BMTune", MessageBoxButtons.OK, MessageBoxIcon.Hand);
                else if (!l̴͚͎̙̻͎̟̩͓͕̜̀̉̓̀͛̿ͣ̆̿̊̃ͨ̄̇̔̀ͣ̒ͣu̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅf̸̡͈͍̳̯̖͊͊͋̂̚̚d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ) MessageBox.Show(".Net framework not found" + Environment.NewLine + "Please install .Net framework 4.5", "BMTune", MessageBoxButtons.OK, MessageBoxIcon.Hand);

                Environment.Exit(0);
            }
            else
            {
                //######################################################
                //Install DLL
                Class34_Zip d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜ = new Class34_Zip();
                d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.ExtractZip();
                string j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "mtssdk.ocx";
                string m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ = "DLL";
                string b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                string u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "Interop.MTSSDKLib.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "mts.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "System.IO.Compression.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "System.IO.Compression.FileSystem.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                /*j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "J2534-Sharp.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }*/
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "Interop.IWshRuntimeLibrary.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "Interop.Shell32.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }
                //##############
                j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡ = "NCalc.dll";
                b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ = Application.StartupPath + @"\" + m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ = Application.StartupPath + @"\" + j̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡;
                if (!File.Exists(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ))
                {
                    d̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅẖ̸̵̢̢̝̥̬̯̯̼͊̏̋ͩͨͫͪ̆̍ͦ̒̾͋̐̉̈ͥ̏ͥ͡i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜.UnZipFile(Application.StartupPath, m̨̫͈̣̦̼̱̦͓͈̲͙̫͈͔̞̟͙̠̲͑͑ͦͦ͛ͧ̓̕͝p̷̨̧͇̗̩͉̲̱̙̬̖̜̝̤̻̱̝̮͕̯͑̒̍͋ͦ̊͘i̶̸̧̪͙͓̯̠̱̝̤͇̅̆͑ͮͭͮ̽͢͜o̭͖̘͙̹͎̦̮̪̠̓ͦ̅̒ͣ̑ͬ̓ͪ̊ͫͤͭ̕͜͠ͅ);
                    File.Create(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ).Dispose();
                    File.WriteAllBytes(u̶̠̘̗̻̼͓̤͓̦̯̝̹̳̺̹͗̽̑̇͌ͯ͐͌̿ͤ͢ͅj̧̡͕̮̘͕̞̹̤̾̇ͤ͂͐͊ͦͮ͟͠b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭ, File.ReadAllBytes(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ));

                    File.Delete(b̸̵̝̘͍̪̫̘̩̙̺̜͓̺̈́̌̒̈ͭd̷̢͈̣͇͙̤̦̟̱̺̩̦͎̞̬̤̪̖̿ͨͪ̈́̓̏ͫͫ̌͆̎̌ͦ̄̈̔̚̚͟c̨̛̥͈̞̺͔̞̼ͧ͆̈̾̐͋̎̚͜͝ͅ);
                }


                //######################################################
                Application.EnableVisualStyles();
                Application.Run(new FrmMain());
            }
        }
    }

    public static string smethod_7(int int_0) 
    {
        return ((int_0 < 0x80ea8) ? ((int_0 < 0x70bf0) ? ((int_0 < 0x709fc) ? ((int_0 < 0x707fe) ? ((int_0 < 0x60632) ? ((int_0 < 0x6040e) ? ((int_0 < 0x6004f) ? ((int_0 < 0x5cbf5) ? ((int_0 < 0x5c733) ? ((int_0 < 0x5c615) ? "No 4.5 or later version detected" : "4.5") : "4.5.1") : "4.5.2") : "4.6") : "4.6.1") : "4.6.2") : "4.7") : "4.7.1") : "4.7.2") : "4.8 or later");
    }
}

